Revit 2024 API
ExternalFileReference Members
The ExternalFileReference type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalFileReference
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAbsolutePath
 Returns an absolute path to the referenced file, regardless of whether the PathType.Enum is relative or absolute.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLinkedFileStatus
 Returns a LinkedFileStatus.Enum corresponding to the load status of the referenced file.
GetPath
 Gets the path of the link, relative or absolute according to the link's settings
GetReferencingId
 Gets the ElementId corresponding to the element which this ExternalFileReference is associated with.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidExternalFileReference
 Checks an ExternalFileReference to see if it is properly created.
IsValidPathTypeForExternalFileReference
 Checks whether a PathType enum value will be valid to use with this ExternalFileReference.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ExternalFileReferenceType
 The type of external file which this object references.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PathType
 The path type of the link (relative, absolute, or server).
See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace